export const NAME_LIST =
    ["刘若溪", "张琼月", "刘小萌", "周智涵", "蒋桢晖", "郭紫珅", "付泽华", "宋鹤年",
        "李文豪", "李皓文", "杨云泽", "王善军", "方俊", "查惠雯", "徐慧茹", "赵俊同",
        "李啸行枫", "梁艺", "常雨露", "张轩明", "王贺", "蒋明希", "高作全", "阮开蓥",
        "罗锦昊", "朱汉陈", "杨晓澍", "刘思琪", "叶瑞涛", "朱泽华", "刘佳宁", "刘洋",
        "郭宇旸", "胡济鹏", "娜米拉", "王沫丹", "黎奕言", "黄臻", "黄小洲", "杜学炜",
        "王嵩源", "李承达", "林旭", "张昊洋", "耿宛茹", "李奕博", "高凌云", "陈甜",
        "邓宇", "林泽宇", "贡锦浩", "王忠元", "杨凯博", "张泰阁", "谷蓉瑄", "陈睦荣",
        "叶晨旭", "吴涛", "潘宗翔", "管浩翔", "马利超", "崔灿", "翟浩淼", "周允乐",
        "罗心悦", "魏新翔", "刘欣悦", "张博宇", "余文锋", "徐瑞", "安琪帆", "朱宇彤",
        "李乐", "武钰新", "苏天鸿", "令狐樟", "柳东起", "李倍乐", "张思远", "付正鸿",
        "沈炫宇", "宿可一", "韩思远", "孙浩铭", "雷蒙", "杨力苏", "张鲡骄", "郑雯齐",
        "杨健", "吴天恩", "程思语", "乔志", "王涵", "孙煜博", "宋亚轩", "林子炀",
        "刘华邦", "康佳", "胡轶宸", "管小风", "张奕成", "刘洪绮", "李胜康", "王绍博",
        "黄彦翔", "李欣阳", "任浩然", "张仲成", "徐海周", "刘美辰", "姚宝烨", "张俊皓",
        "张梦媛", "茹灼玮", "高烜", "施尧", "颜程远", "张倬玮", "姜曹杰", "管鹏宇",
        "赵怡欣", "吴晨越", "袁欣茹", "朱佳美慧", "张恩祺", "白忆晴", "郑文源", "邹旭",
        "蔡欣峻", "李安琪", "韩知冬", "倪炜皓", "王海煊", "周笑语", "李子涵", "姜钰涵",
        "宋韦翰", "刘驰", "张嘉益", "谢睿宇", "赵浩楠", "田泓裕", "储子淳", "牛曦瑶",
        "王瑞琦", "彭中原", "鞠泽宇", "苏泽皓", "谢汀兰", "郭义", "司馥祯", "王华超",
        "王昊天", "龙鑫明", "成乐言", "汪靖淞", "杨翱宇", "沈陈晨", "徐浙", "宋子凡",
        "向一依", "黄子恒", "张澜琼", "李雨桐", "张予进", "叶赟", "汪佳佳", "蔡浩宇",
        "李浩甲", "苗雁双飞", "李东庆", "张凯翔", "皮卓航", "夏歆言", "黄嘉磊", "范奕汐",
        "王祉诺", "李佰聪", "丁奥哲", "尚凡", "张泽楷", "任柏宁", "李柏乐", "刘柏然",
        "邱子芮", "陈奕然", "李浩然", "范吴扬", "詹明学", "鲁晨硕", "张子菡", "华耿祺",
        "王梓越", "邓森", "马恒熙", "路佳鑫", "胡馨尹", "李巍", "汪添翼", "袁奉淳",
        "姜舒", "王子聪", "罗植元", "耿博涵", "何佳", "王冠尧", "徐际航", "常云潇",
        "刘天宇", "刘景赫", "马若翔", "李俊麟", "韩亦晴", "陈立汉", "陈泓仁", "闻坚卓",
        "王煜晟", "王毅博", "王雨晴", "马嘉露", "袁一博", "王勃睿", "李华章", "张舒睿",
        "赵世钊", "王永玥", "吴昊天", "杨滨旭", "张涵迪", "李德轩", "刘涵非", "鲍童畅",
        "高铭泽", "马宏昌", "刘雅萍", "罗润志", "陈奕霖", "王昱圣", "倪绍涵", "武邓昊辰",
        "胡资佳", "陈奕君"];

export const ROOM_ID_RANGE = new Map([
    [-1, [1, 242]],//所有的人
    [321, [1, 88]],
    [325, [89, 177]],
    [329, [178, 242]],
]);

export const DATABASE_NAME = "WanZiXi";
export const TABLE_NAME = "table1";

export const ADMIN_PASSWORD = "adminp";

export const PASSWORD = "04DA069DCC237B88484865E3E7331B35";


export var ACTIVE_DATE = {
    year: 2000,
    month: 1,
    day: 1,
};